hackrid/KDS_SVD/KDS_3_2/MKM34Z7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XBAR</name>
      <description>Crossbar Switch</description>
      <prependToName>XBAR_</prependToName>
      <baseAddress>0x40055000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>XBAR</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>SEL0</name>
          <description>Crossbar Select Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT0 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL1</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT1 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL1</name>
          <description>Crossbar Select Register 1</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL2</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT2 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL3</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT3 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL2</name>
          <description>Crossbar Select Register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL4</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT4 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL5</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT5 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL3</name>
          <description>Crossbar Select Register 3</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL6</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT6 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL7</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT7 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL4</name>
          <description>Crossbar Select Register 4</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL8</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT8 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL9</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT9 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL5</name>
          <description>Crossbar Select Register 5</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL10</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT10 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL11</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT11 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL6</name>
          <description>Crossbar Select Register 6</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL12</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT12 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL13</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT13 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL7</name>
          <description>Crossbar Select Register 7</description>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL14</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT14 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL15</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT15 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL8</name>
          <description>Crossbar Select Register 8</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL16</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT16 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL17</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT17 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL9</name>
          <description>Crossbar Select Register 9</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL18</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT18 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL19</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT19 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL10</name>
          <description>Crossbar Select Register 10</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL20</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT20 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL21</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT21 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL11</name>
          <description>Crossbar Select Register 11</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL22</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT22 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL23</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT23 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL12</name>
          <description>Crossbar Select Register 12</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL24</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT24 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL25</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT25 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL13</name>
          <description>Crossbar Select Register 13</description>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL26</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT26 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL27</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT27 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL14</name>
          <description>Crossbar Select Register 14</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL28</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT28 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL29</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT29 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL15</name>
          <description>Crossbar Select Register 15</description>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL30</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT30 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL31</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT31 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL16</name>
          <description>Crossbar Select Register 16</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL32</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL33</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT33</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL17</name>
          <description>Crossbar Select Register 17</description>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL34</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT34</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL35</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT35</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL18</name>
          <description>Crossbar Select Register 18</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL36</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT36</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL37</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT37</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL19</name>
          <description>Crossbar Select Register 19</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL38</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT38</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL39</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT39</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL20</name>
          <description>Crossbar Select Register 20</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL40</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT40</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL41</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT41</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEL21</name>
          <description>Crossbar Select Register 21</description>
          <addressOffset>0x2A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL42</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT42</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL43</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT43</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
